In [38]:
import pandas as pd
import numpy as np

data = pd.read_csv("athlete_events.csv")

data.head()

missing_count = data.isnull().sum()
print(missing_count)

ID             0
Name           0
Sex            0
Age         9474
Height     60171
Weight     62875
Team           0
NOC            0
Games          0
Year           0
Season         0
City           0
Sport          0
Event          0
Medal     231333
dtype: int64

In [45]:
missing_count = data.isnull().sum()

total_data = np.prod(data.shape)
total_missing = missing_count.sum()
per_of_missing_data = (total_missing / total_data) * 100
print(per_of_missing_data)

0.0

In [37]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 271116 entries, 0 to 271115
Data columns (total 15 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   ID      271116 non-null  int64
 1   Name    271116 non-null  object
 2   Sex     271116 non-null  object
 3   Age     261642 non-null  float64
 4   Height  210945 non-null  float64
 5   Weight  208241 non-null  float64
 6   Team    271116 non-null  object
 7   NOC     271116 non-null  object
 8   Games   271116 non-null  object
 9   Year    271116 non-null  int64
 10  Season  271116 non-null  object
 11  City    271116 non-null  object
 12  Sport   271116 non-null  object
 13  Event   271116 non-null  object
 14  Medal   39783 non-null   object
dtypes: float64(3), int64(2), object(10)
memory usage: 31.0+ MB

In [8]:
data.columns

Index(['ID', 'Name', 'Sex', 'Age', 'Height', 'Weight', 'Team', 'NOC', 'Games',
       'Year', 'Season', 'City', 'Sport', 'Event', 'Medal'],
      dtype='object')

In [44]:
data.index

Index([    40,     41,     42,     44,     48,     50,     60,     61,     63,
           64,
       ...
       271032, 271046, 271048, 271049, 271076, 271078, 271080, 271082, 271102,
       271103],
      dtype='int64', length=30181)

In [10]:
data.shape

(271116, 15)

In [15]:
data.values

array([[1, 'A Dijiang', 'M', ..., 'Basketball',
        "Basketball Men's Basketball", nan],
       [2, 'A Lamusi', 'M', ..., 'Judo', "Judo Men's Extra-Lightweight",
        nan],
       [3, 'Gunnar Nielsen Aaby', 'M', ..., 'Football',
        "Football Men's Football", nan],
       ...,
       [135570, 'Piotr ya', 'M', ..., 'Ski Jumping',
        "Ski Jumping Men's Large Hill, Team", nan],
       [135571, 'Tomasz Ireneusz ya', 'M', ..., 'Bobsleigh',
        "Bobsleigh Men's Four", nan],
       [135571, 'Tomasz Ireneusz ya', 'M', ..., 'Bobsleigh',
        "Bobsleigh Men's Four", nan]], dtype=object)

In [18]:
data[['Medal', 'Year']]

       Medal  Year
0        NaN  1992
1        NaN  2012
2        NaN  1920
3       Gold  1900
4        NaN  1988
...      ...   ...
271111   NaN  1976
271112   NaN  2014
271113   NaN  2014
271114   NaN  1998
271115   NaN  2002

[271116 rows x 2 columns]

In [35]:
data.loc[(data['Name'] == 'Paavo Ilmari Yrjl')]

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal
266447,133284,Paavo Ilmari Yrjl,M,21.0,183.0,82.0,Finland,FIN,1924 Summer,1924,Summer,Paris,Athletics,Athletics Men's Decathlon,NaN
266448,133284,Paavo Ilmari Yrjl,M,25.0,183.0,82.0,Finland,FIN,1928 Summer,1928,Summer,Amsterdam,Athletics,Athletics Men's High Jump,NaN
266449,133284,Paavo Ilmari Yrjl,M,25.0,183.0,82.0,Finland,FIN,1928 Summer,1928,Summer,Amsterdam,Athletics,Athletics Men's Shot Put,NaN
266450,133284,Paavo Ilmari Yrjl,M,25.0,183.0,82.0,Finland,FIN,1928 Summer,1928,Summer,Amsterdam,Athletics,Athletics Men's Decathlon,Gold
266451,133284,Paavo Ilmari Yrjl,M,30.0,183.0,82.0,Finland,FIN,1932 Summer,1932,Summer,Los Angeles,Athletics,Athletics Men's Decathlon,NaN

In [42]:
data = data.dropna(axis = 0, how = 'any')
data.shape

(30181, 15)

In [43]:
missing_count = data.isnull().sum()
print(missing_count)

ID        0
Name      0
Sex       0
Age       0
Height    0
Weight    0
Team      0
NOC       0
Games     0
Year      0
Season    0
City      0
Sport     0
Event     0
Medal     0
dtype: int64